---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.AnalysisDisplayStyleId
source: html/ce7dd3d8-7b3a-9580-cd29-f48bb50d635e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.AnalysisDisplayStyleId Property

ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden

## Syntax (C#)
```csharp
public ElementId AnalysisDisplayStyleId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null